astb_relise/src/Documents/СписаниеСредствЗащитыСотрудника/СписаниеСредствЗащитыСотрудника.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СписаниеСредствЗащитыСотрудника</name>
  <basedOn>Catalog.Сотрудники</basedOn>
  <registerRecords>AccumulationRegister.ВыданныеСредстваЗащиты</registerRecords>
  <registerRecords>AccumulationRegister.ПотребностьВыдачиСИЗ</registerRecords>
  <registerRecords>AccumulationRegister.УточненныеПричиныСписания</registerRecords>
  <registerRecords>AccumulationRegister.ВыдачаПоПотребности</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздательДокумента</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаСписания</name>
    <type>
      <types>EnumRef.ПричиныСписания</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидВыдачиСИЗ</name>
    <type>
      <types>EnumRef.ВидыВыдачиСИЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредседательКомиссии</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДолжностьПредседателя</name>
    <type>
      <types>CatalogRef.ДолжностиИПрофессии</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧленКомиссии1</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность1</name>
    <type>
      <types>CatalogRef.ДолжностиИПрофессии</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧленКомиссии2</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность2</name>
    <type>
      <types>CatalogRef.ДолжностиИПрофессии</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧленКомиссии3</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность3</name>
    <type>
      <types>CatalogRef.ДолжностиИПрофессии</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрисоединенныйФайлМБ7</name>
    <type>
      <types>CatalogRef.СписаниеСредствЗащитыСотрудникаПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>НормаВыдачи</name>
      <type>
        <types>CatalogRef.НормыВыдачиСИЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураНормы</name>
      <type>
        <types>CatalogRef.НоменклатураНормОрганизации</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВыдачи</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентИзноса</name>
      <type>
        <types>CatalogRef.ПроцентыИзноса</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УточненныеПричиныСписания</name>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УточненнаяПричинаСписания</name>
      <type>
        <types>CatalogRef.УточненныеПричиныСписания</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

astb_relise/src/Enums/ПричиныСписания/ПричиныСписания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПричиныСписания</name>
  <enumValues>
    <name>Брак</name>
  </enumValues>
  <enumValues>
    <name>Износ</name>
  </enumValues>
  <enumValues>
    <name>Порча</name>
  </enumValues>
  <enumValues>
    <name>Пропажа</name>
  </enumValues>
  <enumValues>
    <name>Увольнение</name>
  </enumValues>
  <enumValues>
    <name>ОкончаниеСрокаНоски</name>
  </enumValues>
  <enumValues>
    <name>ОтменаНорм</name>
  </enumValues>
  <enumValues>
    <name>ТехническоеСписание</name>
    <comment>АСТБ_Горюшин_Алексей_20510</comment>
  </enumValues>
</mdclass:Enum>

astb_relise/src/Enums/ВидыВыдачиСИЗ/ВидыВыдачиСИЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыВыдачиСИЗ</name>
  <enumValues>
    <name>КоллективнаяВыдача</name>
  </enumValues>
  <enumValues>
    <name>ПерсональнаяВыдача</name>
  </enumValues>
  <enumValues>
    <name>ПроизвольнаяВыдача</name>
  </enumValues>
  <enumValues>
    <name>УпрощеннаяВыдача</name>
  </enumValues>
</mdclass:Enum>

astb_relise/src/Documents/ВозвратСредствЗащитыОтСотрудника/ВозвратСредствЗащитыОтСотрудника.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВозвратСредствЗащитыОтСотрудника</name>
  <basedOn>Document.СписаниеСредствЗащитыСотрудника</basedOn>
  <registerRecords>AccumulationRegister.ОстаткиНоменклатуры</registerRecords>
  <registerRecords>InformationRegister.ИсторияОбращенийНаСклад</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздательДокумента</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.СписаниеСредствЗащитыСотрудника</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>МОЛ</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентИзноса</name>
      <type>
        <types>CatalogRef.ПроцентыИзноса</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

astb_relise/src/Documents/СписаниеСредствЗащитыСотрудника/Forms/ФормаДокумента/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.УстановитьПараметрыФункциональныхОпцийФормы(Новый Структура("Организация", Объект.Организация));
	
	// СтандартныеПодсистемы.Свойства
 	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект,НОВЫЙ Структура("ИмяЭлементаДляРазмещения","ГруппаДополнительныеРеквизиты"));
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.Печать
	УправлениеПечатью.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.Печать
	
	УстановитьПривилегированныйРежим(Истина);
	
	ВозвратСИЗ = Документы.СписаниеСредствЗащитыСотрудника.ПолучитьВозвратСИЗ(Объект.Ссылка,Документы.ВозвратСредствЗащитыОтСотрудника.ПустаяСсылка());
	
	Если ЗначениеЗаполнено(ВозвратСИЗ) Тогда
		ЭтаФорма.ТолькоПросмотр = Истина;
		ЭтаФорма.Элементы.Товары.КоманднаяПанель.ПодчиненныеЭлементы.ТоварыЗаполнить.Видимость = Ложь;
		ЭтаФорма.Элементы.ГруппаПредупреждение.ПодчиненныеЭлементы.ПолеТекстПредупреждения.Заголовок = "Документ заблокирован, т.к. на его основании проведен документ <<Возврат средств защиты от сотрудника>>!";
		ЭтаФорма.Элементы.ГруппаПредупреждение.Видимость = Истина;
	Иначе	
		ЭтаФорма.Элементы.ГруппаПредупреждение.Видимость = Ложь;
	КонецЕсли;
	
	УстановитьВидимостьКолонок();

	УстановитьВидимостьЭлементов();
	
	Если НЕ ЗначениеЗаполнено(ВозвратСИЗ) Тогда
		ЗаполнитьКлючи();
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭлементов()
	
	Если РольДоступна("ПолныеПрава") ИЛИ РольДоступна("ДобавлениеИзменениеСпр_УточненныеПричиныСписания") Тогда	
		Если Объект.ПричинаСписания = Перечисления.ПричиныСписания.Брак ИЛИ Объект.ПричинаСписания = Перечисления.ПричиныСписания.Износ Тогда
			Элементы.УточненныеПричиныСписания.Видимость = Истина;
		Иначе
			Элементы.УточненныеПричиныСписания.Видимость = Ложь;
		КонецЕсли;
	Иначе
		Возврат;
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКлючи()
	
	Если НЕ (РольДоступна("ПолныеПрава") ИЛИ РольДоступна("ДобавлениеИзменениеСпр_УточненныеПричиныСписания")) Тогда
		Возврат;
	КонецЕсли;	
		
	Если НЕ Объект.УточненныеПричиныСписания.Количество() = 0 ИЛИ Параметры.Ключ.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ (Объект.ПричинаСписания = Перечисления.ПричиныСписания.Брак ИЛИ Объект.ПричинаСписания = Перечисления.ПричиныСписания.Износ) Тогда
		Возврат;
	КонецЕсли;
	
	Модифицированность = Ложь;
	
	Для Каждого СтрокаТовары Из Объект.Товары Цикл
		Если ЗначениеЗаполнено(СтрокаТовары.Ключ) Тогда
			Продолжить;
		КонецЕсли;	
		СтрокаТовары.Ключ = СтрокаТовары.НомерСтроки;
		Модифицированность = Истина;
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтаФорма, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
 	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтаФорма, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтаФорма, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
	//присоединенный файл
	Если ИмяСобытия = "Запись_ПрисоединенныйФайл" Тогда
		Объект.ПрисоединенныйФайлМБ7 	= Источник;
		Модифицированность 				= Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	Если НЕ ТекущиеДанные = Неопределено Тогда
		
		Если Элемент.ТекущийЭлемент.Имя = "ТоварыКоличество" Тогда
			Элемент.ТекущиеДанные.Сумма = Элемент.ТекущиеДанные.Количество * Элемент.ТекущиеДанные.Цена;
		ИначеЕсли Элемент.ТекущийЭлемент.Имя = "ТоварыНоменклатура" Тогда
			Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.Номенклатура) Тогда
				Элемент.ТекущиеДанные.Цена = ПолучитьЦенуСервер(Элемент.ТекущиеДанные.Номенклатура);
				Элемент.ТекущиеДанные.Сумма = Элемент.ТекущиеДанные.Количество * Элемент.ТекущиеДанные.Цена;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Объект.СуммаДокумента = Объект.Товары.Итог("Сумма");
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ПОДСИСТЕМЫ "СВОЙСТВА"

// СтандартныеПодсистемы.Свойства
 &НаКлиенте
Процедура Подключаемый_РедактироватьСоставСвойств()
	
	УправлениеСвойствамиКлиент.РедактироватьСоставСвойств(ЭтаФорма, Объект.Ссылка);
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ПОДСИСТЕМЫ "ПЕЧАТЬ"

// СтандартныеПодсистемы.Печать
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	
  УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтаФорма, Объект);
  
КонецПроцедуры
// Конец СтандартныеПодсистемы.Печать

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ...

// СтандартныеПодсистемы.Свойства
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьЦенуСервер(Номенклатура)
	Цена = ЦенообразованиеСерверПереопределяемый.ПолучитьЦену(Номенклатура,Объект.Организация,Объект.Дата);
	Возврат Цена;
КонецФункции

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");	
	
	Документы.СписаниеСредствЗащитыСотрудника.ЗаполнитьДокумент(ТекущийОбъект.Сотрудник,ТекущийОбъект);
	
	ЗначениеВРеквизитФормы(ТекущийОбъект,"Объект");
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	
	ЗаполнитьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПричинаСписанияПриИзменении(Элемент)
	
	Объект.Товары.Очистить();
	Объект.УточненныеПричиныСписания.Очистить();
	
	Если Объект.ПричинаСписания = ПредопределенноеЗначение("Перечисление.ПричиныСписания.Увольнение") Тогда	
		//отсечка убрана 13.06.2019 по требованию И. Озеровой
		//ЭтаФорма.Элементы.Товары.ПодчиненныеЭлементы.ТоварыКоличество.ТолькоПросмотр 		= Истина;
		//АсТБ_Alexey_70746********************************************************************
		//ЭтаФорма.Элементы.Товары.ПодчиненныеЭлементы.ТоварыДатаВыдачи.Видимость 			= Ложь;
		//АсТБ_Alexey_70746********************************************************************
	Иначе
		//отсечка убрана 13.06.2019 по требованию И. Озеровой
		//ЭтаФорма.Элементы.Товары.ПодчиненныеЭлементы.ТоварыКоличество.ТолькоПросмотр 		= Ложь;
		//АсТБ_Alexey_70746********************************************************************
		//ЭтаФорма.Элементы.Товары.ПодчиненныеЭлементы.ТоварыДатаВыдачи.Видимость 			= Истина;
		//АсТБ_Alexey_70746********************************************************************
	КонецЕсли;
	
	УстановитьВидимостьЭлементов();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьКолонок()
	
	Если Объект.ВидВыдачиСИЗ = Перечисления.ВидыВыдачиСИЗ.КоллективнаяВыдача Тогда
		//АсТБ_Alexey_70746********************************************************************
		//ЭтаФорма.Элементы.Товары.ПодчиненныеЭлементы.ТоварыДатаВыдачи.Видимость 	= ИСТИНА;
		//АсТБ_Alexey_70746********************************************************************
		ЭтаФорма.Элементы.Товары.ПодчиненныеЭлементы.ТоварыНормаВыдачи.Видимость	= Истина;
	ИначеЕсли Объект.ВидВыдачиСИЗ = Перечисления.ВидыВыдачиСИЗ.ПерсональнаяВыдача Тогда
		Если Объект.ПричинаСписания = Перечисления.ПричиныСписания.Увольнение Тогда	
			//АсТБ_Alexey_70746********************************************************************
			//ЭтаФорма.Элементы.Товары.ПодчиненныеЭлементы.ТоварыДатаВыдачи.Видимость = Ложь;
			//АсТБ_Alexey_70746********************************************************************
		Иначе
			//АсТБ_Alexey_70746********************************************************************
			//ЭтаФорма.Элементы.Товары.ПодчиненныеЭлементы.ТоварыДатаВыдачи.Видимость = Истина;
			//АсТБ_Alexey_70746********************************************************************
		КонецЕсли;
		ЭтаФорма.Элементы.Товары.ПодчиненныеЭлементы.ТоварыНормаВыдачи.Видимость	= Истина;
	Иначе //произвольная или упрощенная выдача
		//АсТБ_Alexey_70746********************************************************************
		//ЭтаФорма.Элементы.Товары.ПодчиненныеЭлементы.ТоварыДатаВыдачи.Видимость 	= ИСТИНА;
		//АсТБ_Alexey_70746********************************************************************
		ЭтаФорма.Элементы.Товары.ПодчиненныеЭлементы.ТоварыНормаВыдачи.Видимость	= Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидВыдачиСИЗПриИзменении(Элемент)
	
	Объект.Товары.Очистить();
	Объект.УточненныеПричиныСписания.Очистить();
	
	УстановитьВидимостьКолонок();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	АлгоритмФормированияПотребности = ПроцедурыРаботыСНормамиСервер.ПолучитьАлгоритмФормированияПотребности(Объект.Организация);
	
	Если АлгоритмФормированияПотребности = Неопределено Тогда
		Возврат;
	КонецЕсли;                                               
	
	Выполнить("Алгоритм_" + АлгоритмФормированияПотребности + "_Клиент.СписаниеСИЗ_УправлениеДоступностью(ЭтаФорма)");
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ЭтаФорма.УстановитьПараметрыФункциональныхОпцийФормы(Новый Структура("Организация", Объект.Организация));
	
	Объект.Товары.Очистить();
	Объект.УточненныеПричиныСписания.Очистить();
	
	АлгоритмФормированияПотребности = ПроцедурыРаботыСНормамиСервер.ПолучитьАлгоритмФормированияПотребности(Объект.Организация);
	
	Если АлгоритмФормированияПотребности = Неопределено Тогда
		Возврат;
	КонецЕсли;                                               
	
	Выполнить("Алгоритм_" + АлгоритмФормированияПотребности + "_Клиент.СписаниеСИЗ_УправлениеДоступностью(ЭтаФорма)");
	
КонецПроцедуры

&НаКлиенте
Процедура УточненныеПричиныСписанияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	ТекущиеДанныеТовары = ЭтаФорма.Элементы.Товары.ТекущиеДанные;
	
	Если ТекущиеДанныеТовары = Неопределено Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УточненныеПричиныСписанияПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	КлючТовары = ЭтаФорма.Элементы.Товары.ТекущиеДанные.Ключ;
	
	ТекущиеДанные = ЭтаФорма.Элементы.УточненныеПричиныСписания.ТекущиеДанные;
	ТекущиеДанные.Ключ = КлючТовары;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанныеТовары = ЭтаФорма.Элементы.Товары.ТекущиеДанные;
	
	Если ТекущиеДанныеТовары = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЭтаФорма.Элементы.УточненныеПричиныСписания.ОтборСтрок = Новый ФиксированнаяСтруктура("Ключ",ТекущиеДанныеТовары.Ключ);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	ТекущиеДанныеТовары = ЭтаФорма.Элементы.Товары.ТекущиеДанные;
	Если НоваяСтрока Тогда
		ТекущиеДанныеТовары.Ключ = ТекущиеДанныеТовары.НомерСтроки;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПрисоединенныйФайлМБ7НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПрисоединенныеФайлыКлиент.ОткрытьФормуВыбораФайлов(Объект.Ссылка, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПрисоединенныйФайлМБ7Открытие(Элемент, СтандартнаяОбработка)
	
	ПрисоединенныеФайлыКлиент.ОткрытьФормуПрисоединенногоФайла(Объект.ПрисоединенныйФайлМБ7, СтандартнаяОбработка);
	
КонецПроцедуры

//+++АСТБ_Горюшин_Алексей_20510
// Поле ПричинаСписания: добавлен вариант ТехническоеСписание в список выбора
//---АСТБ_Горюшин_Алексей_20510
